### Getting Started with Pandas

In [1]:
import pandas as pd

In [2]:
from pandas import Series, DataFrame

In [3]:
import numpy as np
np.random.seed(12345)

In [7]:
import matplotlib.pyplot as plt
plt.rc('figure',figsize=(10, 6))#显示图像的最大范围
PREVIOUS_MAX_ROWS = pd.options.display.max_rows
pd.options.display.max_rows = 20
np.set_printoptions(precision=4, suppress=True)

###### 在notebook中显示图像
%matplotlib inline

###### Series

In [8]:
obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [9]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [10]:
obj.index  #like range(4)

RangeIndex(start=0, stop=4, step=1)

In [11]:
obj2 = pd.Series([4, 7, -5, 3], index = ['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [12]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [13]:
obj2['a']

-5

In [14]:
obj2['d'] = 6

In [15]:
obj2[['c','a','d']]

c    3
a   -5
d    6
dtype: int64

In [16]:
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [17]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [18]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [19]:
'b' in obj2

True

In [20]:
'e' in obj2

False

In [21]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = pd.Series(sdata)
obj3

Ohio       35000
Oreagon    16000
Texas      71000
Utah        5000
dtype: int64

In [22]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = pd.Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oreagon       16000.0
Texas         71000.0
dtype: float64

In [26]:
obj5 = pd.Series([35000,71000,16000,5000],index = ['California', 'Ohio', 'Oregon', 'Texas'])
obj5

California    35000
Ohio          71000
Oregon        16000
Texas          5000
dtype: int64

In [27]:
pd.isnull(obj4)

California     True
Ohio          False
Oreagon       False
Texas         False
dtype: bool

In [28]:
pd.notnull(obj4)

California    False
Ohio           True
Oreagon        True
Texas          True
dtype: bool

In [29]:
pd.isnull(obj5)

California    False
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [30]:
obj4.isnull()

California     True
Ohio          False
Oreagon       False
Texas         False
dtype: bool

In [31]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oreagon        32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [32]:
obj5.name = 'population'
obj5.index.name = 'state'
obj5

state
California    35000
Ohio          71000
Oregon        16000
Texas          5000
Name: population, dtype: int64

In [34]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [81]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

In [82]:
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002
5  3.2  Nevada  2003

In [83]:
frame.head()

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [84]:
pd.DataFrame(data, columns = ['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [85]:
frame2 = pd.DataFrame(data,columns = ['year', 'state', 'pop', 'debt'],
                     index = ['one', 'two', 'three', 'four', 'five', 'six'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [86]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [87]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [88]:
frame2['debt'] = 16.4
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.4
two    2001    Ohio  1.7  16.4
three  2002    Ohio  3.6  16.4
four   2001  Nevada  2.4  16.4
five   2002  Nevada  2.9  16.4
six    2003  Nevada  3.2  16.4

In [89]:
frame2['debt'] = np.arange(6)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Nevada  2.4     3
five   2002  Nevada  2.9     4
six    2003  Nevada  3.2     5

In [90]:
val = pd.Series([-1.2, -1.5, -1.7], index = ['two', 'four', 'five'])
print(val)

two    -1.2
four   -1.5
five   -1.7
dtype: float64

In [91]:
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [46]:
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt eastern
one    2000    Ohio  1.5   NaN    True
 two   2001    Ohio  1.7   NaN    True
three  2002    Ohio  3.6   NaN    True
four   2001  Nevada  2.4  -1.5   False
five   2002  Nevada  2.9  -1.7   False
six    2003  Nevada  3.2   NaN   False

###### 
del frame['index'] 删除列
data.drop('')  删除行

In [47]:
del frame2['eastern']
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [63]:
print(frame2.drop('six'))

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
 two   2001    Ohio  1.7   NaN
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [58]:
data = pd.DataFrame([[1, 2, 3],[4, 5, 6]])
data

   0  1  2
0  1  2  3
1  4  5  6

In [60]:
print(data.drop(1))

   0  1  2
0  1  2  3

In [2]:
import pandas as pd
pd.DataFrame(pop, index = [2001, 2002, 2003])

NameError: name 'pop' is not defined

In [3]:
obj = pd.Series(range(3),index = ['a', 'b', 'c'])
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [4]:
index[1:]

Index(['b', 'c'], dtype='object')

In [6]:
import numpy as np
labels = pd.Index(np.arange(3))
labels

Int64Index([0, 1, 2], dtype='int64')

In [7]:
obj2 = pd.Series([1.5, -2.5, 0], index = labels)
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [8]:
obj2.index is labels

True

In [10]:
dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

In [3]:
import pandas as pd
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [12]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj

a    0
b    1
c    2
dtype: int32

In [5]:
obj3 = pd.Series(['blue','purple','yellow'], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

###### 缺失值的处理可以用到几个方法
reindex()方法，对指定轴上的索引进行改变、增加、删除，将返回一个原数据的拷贝

In [8]:
import numpy as np

In [10]:
dates = pd.date_range('20180101', periods = 6)
dates

DatetimeIndex(['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04',
               '2018-01-05', '2018-01-06'],
              dtype='datetime64[ns]', freq='D')

In [11]:
df = pd.DataFrame(np.random.randn(6, 4), index = dates, columns=list('ABCD'))
df

                   A         B         C         D
2018-01-01  1.090987  0.189049 -0.609122  0.909269
2018-01-02  1.292001  0.854643  1.661581 -0.972772
2018-01-03  0.431781  0.367566  0.459812 -0.072490
2018-01-04 -0.314615 -1.894243 -0.843832  0.044157
2018-01-05  0.589078  0.819267  0.436695 -1.362919
2018-01-06  0.849722 -0.140959 -0.329755  0.091848

######  去掉包含缺失值的行

In [14]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])

In [17]:
df1.loc[dates[0]:dates[1], 'E'] = 1

In [18]:
df1

                   A         B         C         D    E
2018-01-01  1.090987  0.189049 -0.609122  0.909269  1.0
2018-01-02  1.292001  0.854643  1.661581 -0.972772  1.0
2018-01-03  0.431781  0.367566  0.459812 -0.072490  NaN
2018-01-04 -0.314615 -1.894243 -0.843832  0.044157  NaN

In [19]:
df1.dropna(how='any')

                   A         B         C         D    E
2018-01-01  1.090987  0.189049 -0.609122  0.909269  1.0
2018-01-02  1.292001  0.854643  1.661581 -0.972772  1.0

###### 对缺失值进行填充

In [22]:
df1.fillna(value=5)

                   A         B         C         D    E
2018-01-01  1.090987  0.189049 -0.609122  0.909269  1.0
2018-01-02  1.292001  0.854643  1.661581 -0.972772  1.0
2018-01-03  0.431781  0.367566  0.459812 -0.072490  5.0
2018-01-04 -0.314615 -1.894243 -0.843832  0.044157  5.0

###### 对缺失值进行布尔填充

In [23]:
pd.isnull(df1)

                A      B      C      D      E
2018-01-01  False  False  False  False  False
2018-01-02  False  False  False  False  False
2018-01-03  False  False  False  False   True
2018-01-04  False  False  False  False   True

In [15]:
df1

                   A         B         C         D   E
2018-01-01  1.090987  0.189049 -0.609122  0.909269 NaN
2018-01-02  1.292001  0.854643  1.661581 -0.972772 NaN
2018-01-03  0.431781  0.367566  0.459812 -0.072490 NaN
2018-01-04 -0.314615 -1.894243 -0.843832  0.044157 NaN

In [6]:
obj3.reindex(range(6), method = 'ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [25]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                    index=['a', 'c', 'd'],
                    columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [26]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [28]:
frame3 = frame.reindex(['a','e', 'b', 'c', 'd'])
frame3

   Ohio  Texas  California
a   0.0    1.0         2.0
e   NaN    NaN         NaN
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [27]:
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [29]:
frame.loc[['a', 'b', 'c', 'd'], states]

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

#### Dropping Entries from an Axis

In [30]:
obj = pd.Series(np.arange(5.), index = ['a', 'b', 'c', 'd', 'e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [32]:
obj2 = pd.Series(np.arange(5), index = ['a', 'b', 'c', 'd', 'e'])
obj2

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [33]:
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [34]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [35]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [36]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                   index = ['Ohio', 'Colorado', 'Utah', 'New York'],
                   columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [37]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [38]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [40]:
data.drop('two', axis = 1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [41]:
data.drop(['two', 'four'], axis = 'columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [42]:
obj.drop('c', inplace=True)

In [43]:
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

###### 删除 pandas DataFrame的某几行/列
1、 直接del DataFrame['column-name']
2、 drop
(1) DF = DF.drop('column_name', 1)
(2) DF.drop('column_name', axis=1, inplace=True)
(3) DF.drop([DF.columns[[0, 1, 3]]], axis=1,inplace=True)
采用inplace=True之后，原数组名（如2和3情况所示）对应的内存值直接改变；而采用inplace=False之后，原数组名对应的内存值并不改变，需要将新的结果赋给一个新的数组或者覆盖原数组的内存位置

##### Indexing, Selection, and Filtering

In [45]:
obj = pd.Series(np.arange(4.), index = ['a', 'b', 'c', 'd'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [46]:
obj['b']

1.0

In [48]:
obj[0]

0.0

In [49]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [50]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [51]:
obj['b':'d']

b    1.0
c    2.0
d    3.0
dtype: float64

In [53]:
obj['b':'d'] = 5
obj

a    0.0
b    5.0
c    5.0
d    5.0
dtype: float64

In [54]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                   index = ['Ohio', 'Colorado', 'Utah', 'New York'],
                   columns = ['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [55]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [56]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [57]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [58]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [59]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [62]:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int32

In [63]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [64]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [65]:
data.loc[:'Utah', 'two']

Ohio        1
Colorado    5
Utah        9
Name: two, dtype: int32

In [66]:
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    4    5      6
Utah        8    9     10
New York   12   13     14

###### Integer Indexs

In [69]:
ser = pd.Series(np.arange(3.))

In [70]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [71]:
ser2 = pd.Series(np.arange(3.), index=['a', 'b', 'c'])
ser2[-1]

2.0

In [72]:
ser[:1]

0    0.0
dtype: float64

In [74]:
ser.loc[:1]

0    0.0
1    1.0
dtype: float64

In [76]:
ser.iloc[:1]

0    0.0
dtype: float64

###### loc 和 iloc区别
1、loc通过行标签索引行数据
loc['d']表示索引的是第‘d'行（index是字符）
loc可以获取多行数据
loc扩展一索引某行某列
2、iloc通过行号获取行数据，通过行标签索引会报错
iloc通过行号可以索引多行

##### Arithmetic and Data Alignment

In [1]:
import pandas as pd

In [2]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index = ['a', 'c', 'd', 'e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],
               index = ['a', 'c', 'e', 'f', 'g'])

In [3]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [4]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [5]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [9]:
import numpy as np

In [10]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns = list('bcd'),
                  index = ['Ohio', 'Texas', 'Colorado'])
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns = list('bde'),
                  index = ['Utah', 'Ohio', 'Texas', 'Oregon'])

In [11]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [12]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [13]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [15]:
df1 = pd.DataFrame({'A' : [1, 2]})
df1

   A
0  1
1  2

In [16]:
df2 = pd.DataFrame({'A' : [3 , 4]})
df2

   A
0  3
1  4

In [17]:
df1 - df2

   A
0 -2
1 -2

#####  Arithmetic methods with fill values

In [18]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
                  columns = list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
                  columns = list('abcde'))

In [19]:
df2.loc[1, 'b'] = np.nan

In [20]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [21]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [23]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [24]:
1 / df1

          a         b         c         d
0       inf  1.000000  0.500000  0.333333
1  0.250000  0.200000  0.166667  0.142857
2  0.125000  0.111111  0.100000  0.090909

In [25]:
df1.rdiv(1)

          a         b         c         d
0       inf  1.000000  0.500000  0.333333
1  0.250000  0.200000  0.166667  0.142857
2  0.125000  0.111111  0.100000  0.090909

In [26]:
df1.reindex(columns = df2.columns, fill_value = 0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

####  Operations between DataFrame and Series

In [1]:
import numpy as np
import pandas as pd

In [2]:
arr = np.arange(12.).reshape((3, 4))
arr

array([[  0.,   1.,   2.,   3.],
       [  4.,   5.,   6.,   7.],
       [  8.,   9.,  10.,  11.]])

In [3]:
arr[0]

array([ 0.,  1.,  2.,  3.])

In [4]:
arr - arr[0]

array([[ 0.,  0.,  0.,  0.],
       [ 4.,  4.,  4.,  4.],
       [ 8.,  8.,  8.,  8.]])

In [5]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                     columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [6]:
series = frame.iloc[0]

In [7]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [8]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [9]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [10]:
series2 = pd.Series(range(3), index = ['b', 'e', 'f'])

In [11]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [12]:
series3 = frame['d']
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [13]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

###### sub 求差集
DataFrame.sub(other,axis='columns', level=None, fill_value=None)
other: Series, DataFrame, constant
axis: {0,1, 'index', 'columns}
Rturns: DataFrame

In [14]:
frame.sub(series3, axis = 'index')

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

#### Function Application and Mapping

In [15]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
                    index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah   -1.967856  1.921362 -0.493482
Ohio   -0.754363 -0.164659  0.856933
Texas  -1.600983  0.477379 -1.506451
Oregon  1.126928  0.466099  1.888132

In [16]:
np.abs(frame)

               b         d         e
Utah    1.967856  1.921362  0.493482
Ohio    0.754363  0.164659  0.856933
Texas   1.600983  0.477379  1.506451
Oregon  1.126928  0.466099  1.888132

#### 在DataFrame中应用lambda函数

In [17]:
f = lambda x: x.max() - x.min()
frame.apply(f)

b    3.094784
d    2.086020
e    3.394583
dtype: float64

In [18]:
frame.apply(f, axis='columns')

Utah      3.889218
Ohio      1.611296
Texas     2.078361
Oregon    1.422033
dtype: float64

In [20]:
def f(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])

In [21]:
frame.apply(f)

            b         d         e
min -1.967856 -0.164659 -1.506451
max  1.126928  1.921362  1.888132

###### 遍历格式化元素
dataframe.applymap(xx)

In [22]:
format = lambda x: '%.2f' % x
frame.applymap(format)

            b      d      e
Utah    -1.97   1.92  -0.49
Ohio    -0.75  -0.16   0.86
Texas   -1.60   0.48  -1.51
Oregon   1.13   0.47   1.89

In [23]:
frame['e'].map(format)

Utah      -0.49
Ohio       0.86
Texas     -1.51
Oregon     1.89
Name: e, dtype: object

#### Sorting and Ranking

In [24]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int32

In [26]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                    index = ['three', 'one'],
                    columns = ['d', 'a', 'b', 'c'])

In [27]:
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

###### DataFrame.sort_index()/sort_index(axis=1)

In [28]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [31]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [32]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [34]:
obj = pd.Series([4, 7, -3, 2])
obj

0    4
1    7
2   -3
3    2
dtype: int64

In [35]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

###### 包含np.nan为浮点型

In [36]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj

0    4.0
1    NaN
2    7.0
3    NaN
4   -3.0
5    2.0
dtype: float64

In [37]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [38]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [39]:
frame.sort_values(by='b')

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [40]:
frame.sort_values(by=['a', 'b'])

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

###### 排名，相同的数取排名平均，求秩
method:
average 默认 相等分组求平均秩
min 使用整个分组的最小排名
max 使用整个分组的最大排名
first 按值在原始数据中的出现顺序分配排名

In [41]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [42]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [43]:
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [45]:
frame = pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
                     'c': [-2, 5, 8, -2.5]})
frame

   a    b    c
0  0  4.3 -2.0
1  1  7.0  5.0
2  0 -3.0  8.0
3  1  2.0 -2.5

In [46]:
frame.rank(axis='columns')

     a    b    c
0  2.0  3.0  1.0
1  1.0  3.0  2.0
2  2.0  1.0  3.0
3  2.0  3.0  1.0

#### Axis Indexes with Duplicate Labels

In [47]:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int32

######  当index存在重复值时，可以用obj.index.is_unique判断

In [49]:
obj.index.is_unique

False

In [50]:
obj['a']

a    0
a    1
dtype: int32

In [51]:
obj['c']

4

In [ ]:
df = pd.DataFrame(np.random.randn(4,3), index=['a', 'a', 'b', 'b'])